; domain
(define (domain zeno-travel)
(:requirements :typing)
(:types aircraft person city flevel - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (nxt ?l1 ?l2 - flevel))


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)))

(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)
 
 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (nxt ?l2 ?l1))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l2)))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)

 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (nxt ?l2 ?l1)
		 (nxt ?l3 ?l2)
		)
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l3)
	)
) 

(:action refuel
 :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)

 :precondition (and (fuel-level ?a ?l)
                 (nxt ?l ?l1)
                 (at ?a ?c))
 :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l))))


)

; problem
(define (problem ZTRAVEL-5-20)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city11)
	(fuel-level plane1 fl3)
	(at plane2 city12)
	(fuel-level plane2 fl3)
	(at plane3 city12)
	(fuel-level plane3 fl0)
	(at plane4 city14)
	(fuel-level plane4 fl0)
	(at plane5 city14)
	(fuel-level plane5 fl6)
	(at person1 city7)
	(at person2 city16)
	(at person3 city9)
	(at person4 city6)
	(at person5 city6)
	(at person6 city0)
	(at person7 city6)
	(at person8 city8)
	(at person9 city13)
	(at person10 city14)
	(at person11 city7)
	(at person12 city15)
	(at person13 city4)
	(at person14 city14)
	(at person15 city10)
	(at person16 city5)
	(at person17 city10)
	(at person18 city11)
	(at person19 city9)
	(at person20 city3)
	(nxt fl0 fl1)
	(nxt fl1 fl2)
	(nxt fl2 fl3)
	(nxt fl3 fl4)
	(nxt fl4 fl5)
	(nxt fl5 fl6)
)
(:goal (and
	(at plane2 city6)
	(at person1 city2)
	(at person2 city17)
	(at person3 city7)
	(at person4 city14)
	(at person5 city9)
	(at person6 city13)
	(at person7 city6)
	(at person8 city8)
	(at person9 city4)
	(at person10 city16)
	(at person11 city6)
	(at person12 city4)
	(at person13 city14)
	(at person14 city2)
	(at person15 city9)
	(at person16 city9)
	(at person17 city15)
	(at person18 city6)
	(at person19 city2)
	(at person20 city17)
	))

)

; plan
1. (board person10 plane5 city14)
   deleted: (at person10 city14)
   added: (in person10 plane5)
   goals met: 2 of 21
2. (board person14 plane5 city14)
   deleted: (at person14 city14)
   added: (in person14 plane5)
   goals met: 2 of 21
3. (board person18 plane1 city11)
   deleted: (at person18 city11)
   added: (in person18 plane1)
   goals met: 2 of 21
4. (fly plane5 city14 city0 fl6 fl5)
   deleted: (at plane5 city14) (fuel-level plane5 fl6)
   added: (at plane5 city0) (fuel-level plane5 fl5)
   goals met: 2 of 21
5. (board person6 plane5 city0)
   deleted: (at person6 city0)
   added: (in person6 plane5)
   goals met: 2 of 21
6. (fly plane5 city0 city5 fl5 fl4)
   deleted: (at plane5 city0) (fuel-level plane5 fl5)
   added: (at plane5 city5) (fuel-level plane5 fl4)
   goals met: 2 of 21
7. (board person16 plane5 city5)
   deleted: (at person16 city5)
   added: (in person16 plane5)
   goals met: 2 of 21
8. (fly plane5 city5 city10 fl4 fl3)
   deleted: (at plane5 city5) (fuel-level plane5 fl4)
   added: (at plane5 city10) (fuel-level plane5 fl3)
   goals met: 2 of 21
9. (board person15 plane5 city10)
   deleted: (at person15 city10)
   added: (in person15 plane5)
   goals met: 2 of 21
10. (board person17 plane5 city10)
   deleted: (at person17 city10)
   added: (in person17 plane5)
   goals met: 2 of 21
11. (fly plane5 city10 city3 fl3 fl2)
   deleted: (at plane5 city10) (fuel-level plane5 fl3)
   added: (at plane5 city3) (fuel-level plane5 fl2)
   goals met: 2 of 21
12. (board person20 plane5 city3)
   deleted: (at person20 city3)
   added: (in person20 plane5)
   goals met: 2 of 21
13. (fly plane5 city3 city13 fl2 fl1)
   deleted: (at plane5 city3) (fuel-level plane5 fl2)
   added: (at plane5 city13) (fuel-level plane5 fl1)
   goals met: 2 of 21
14. (board person9 plane5 city13)
   deleted: (at person9 city13)
   added: (in person9 plane5)
   goals met: 2 of 21
15. (debark person6 plane5 city13)
   deleted: (in person6 plane5)
   added: (at person6 city13)
   goals met: 3 of 21
16. (fly plane5 city13 city16 fl1 fl0)
   deleted: (at plane5 city13) (fuel-level plane5 fl1)
   added: (at plane5 city16) (fuel-level plane5 fl0)
   goals met: 3 of 21
17. (refuel plane5 city16 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 3 of 21
18. (board person2 plane5 city16)
   deleted: (at person2 city16)
   added: (in person2 plane5)
   goals met: 3 of 21
19. (debark person10 plane5 city16)
   deleted: (in person10 plane5)
   added: (at person10 city16)
   goals met: 4 of 21
20. (fly plane5 city16 city15 fl1 fl0)
   deleted: (at plane5 city16) (fuel-level plane5 fl1)
   added: (at plane5 city15) (fuel-level plane5 fl0)
   goals met: 4 of 21
21. (refuel plane5 city15 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 4 of 21
22. (board person12 plane5 city15)
   deleted: (at person12 city15)
   added: (in person12 plane5)
   goals met: 4 of 21
23. (debark person17 plane5 city15)
   deleted: (in person17 plane5)
   added: (at person17 city15)
   goals met: 5 of 21
24. (fly plane5 city15 city4 fl1 fl0)
   deleted: (at plane5 city15) (fuel-level plane5 fl1)
   added: (at plane5 city4) (fuel-level plane5 fl0)
   goals met: 5 of 21
25. (refuel plane5 city4 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 5 of 21
26. (board person13 plane5 city4)
   deleted: (at person13 city4)
   added: (in person13 plane5)
   goals met: 5 of 21
27. (debark person9 plane5 city4)
   deleted: (in person9 plane5)
   added: (at person9 city4)
   goals met: 6 of 21
28. (debark person12 plane5 city4)
   deleted: (in person12 plane5)
   added: (at person12 city4)
   goals met: 7 of 21
29. (fly plane5 city4 city17 fl1 fl0)
   deleted: (at plane5 city4) (fuel-level plane5 fl1)
   added: (at plane5 city17) (fuel-level plane5 fl0)
   goals met: 7 of 21
30. (refuel plane5 city17 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 7 of 21
31. (debark person2 plane5 city17)
   deleted: (in person2 plane5)
   added: (at person2 city17)
   goals met: 8 of 21
32. (debark person20 plane5 city17)
   deleted: (in person20 plane5)
   added: (at person20 city17)
   goals met: 9 of 21
33. (fly plane5 city17 city7 fl1 fl0)
   deleted: (at plane5 city17) (fuel-level plane5 fl1)
   added: (at plane5 city7) (fuel-level plane5 fl0)
   goals met: 9 of 21
34. (refuel plane5 city7 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 9 of 21
35. (board person1 plane5 city7)
   deleted: (at person1 city7)
   added: (in person1 plane5)
   goals met: 9 of 21
36. (board person11 plane5 city7)
   deleted: (at person11 city7)
   added: (in person11 plane5)
   goals met: 9 of 21
37. (fly plane5 city7 city6 fl1 fl0)
   deleted: (at plane5 city7) (fuel-level plane5 fl1)
   added: (at plane5 city6) (fuel-level plane5 fl0)
   goals met: 9 of 21
38. (refuel plane5 city6 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 9 of 21
39. (board person4 plane5 city6)
   deleted: (at person4 city6)
   added: (in person4 plane5)
   goals met: 9 of 21
40. (board person5 plane5 city6)
   deleted: (at person5 city6)
   added: (in person5 plane5)
   goals met: 9 of 21
41. (debark person11 plane5 city6)
   deleted: (in person11 plane5)
   added: (at person11 city6)
   goals met: 10 of 21
42. (fly plane1 city11 city6 fl3 fl2)
   deleted: (at plane1 city11) (fuel-level plane1 fl3)
   added: (at plane1 city6) (fuel-level plane1 fl2)
   goals met: 10 of 21
43. (debark person18 plane1 city6)
   deleted: (in person18 plane1)
   added: (at person18 city6)
   goals met: 11 of 21
44. (fly plane2 city12 city6 fl3 fl2)
   deleted: (at plane2 city12) (fuel-level plane2 fl3)
   added: (at plane2 city6) (fuel-level plane2 fl2)
   goals met: 12 of 21
45. (fly plane5 city6 city14 fl1 fl0)
   deleted: (at plane5 city6) (fuel-level plane5 fl1)
   added: (at plane5 city14) (fuel-level plane5 fl0)
   goals met: 12 of 21
46. (refuel plane5 city14 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 12 of 21
47. (debark person4 plane5 city14)
   deleted: (in person4 plane5)
   added: (at person4 city14)
   goals met: 13 of 21
48. (debark person13 plane5 city14)
   deleted: (in person13 plane5)
   added: (at person13 city14)
   goals met: 14 of 21
49. (fly plane5 city14 city9 fl1 fl0)
   deleted: (at plane5 city14) (fuel-level plane5 fl1)
   added: (at plane5 city9) (fuel-level plane5 fl0)
   goals met: 14 of 21
50. (refuel plane5 city9 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 14 of 21
51. (board person3 plane5 city9)
   deleted: (at person3 city9)
   added: (in person3 plane5)
   goals met: 14 of 21
52. (board person19 plane5 city9)
   deleted: (at person19 city9)
   added: (in person19 plane5)
   goals met: 14 of 21
53. (debark person5 plane5 city9)
   deleted: (in person5 plane5)
   added: (at person5 city9)
   goals met: 15 of 21
54. (debark person15 plane5 city9)
   deleted: (in person15 plane5)
   added: (at person15 city9)
   goals met: 16 of 21
55. (debark person16 plane5 city9)
   deleted: (in person16 plane5)
   added: (at person16 city9)
   goals met: 17 of 21
56. (fly plane5 city9 city7 fl1 fl0)
   deleted: (at plane5 city9) (fuel-level plane5 fl1)
   added: (at plane5 city7) (fuel-level plane5 fl0)
   goals met: 17 of 21
57. (refuel plane5 city7 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 17 of 21
58. (debark person3 plane5 city7)
   deleted: (in person3 plane5)
   added: (at person3 city7)
   goals met: 18 of 21
59. (fly plane5 city7 city2 fl1 fl0)
   deleted: (at plane5 city7) (fuel-level plane5 fl1)
   added: (at plane5 city2) (fuel-level plane5 fl0)
   goals met: 18 of 21
60. (debark person1 plane5 city2)
   deleted: (in person1 plane5)
   added: (at person1 city2)
   goals met: 19 of 21
61. (debark person14 plane5 city2)
   deleted: (in person14 plane5)
   added: (at person14 city2)
   goals met: 20 of 21
62. (debark person19 plane5 city2)
   deleted: (in person19 plane5)
   added: (at person19 city2)
   goals met: 21 of 21
